{
  "members": [
   
    {
      "id": "akintoroye-williams-akinlolu",
      "name": "Hon. Justice Akintoroye Williams Akinlolu",
      "credentials": "LL.B, BL",
      "position": "Pioneer Chairman",
      "image": "/_static/images/pics/0-1.jpg",
      "bio": "Hon. Justice Akintoroye Williams Akinlolu is the pioneer Chairman of the Ondo State Public Complaints, Financial Crime and Anti-Corruption Commission. Born in Ondo Local Government (now Ondo West Local Government Council) on the 5th of November, 1957, he graduated from the University of Lagos, obtaining a Bachelor of Laws (LL.B) degree in 1983. He proceeded to the Nigerian Law School, Lagos, and was called to the Bar in 1984.\n\nAfter completing his mandatory National Youth Service Corps (NYSC), Justice Akintoroye joined the private law firm of Chief Olabisi Akinsiku in Ondo in 1985. He practiced law actively until August 2002, when he was appointed as a High Court Judge. Over his judicial career, he served in various Judicial Divisions of the Ondo State Judiciary, including Okitipupa, Ondo, Oka-Akoko, Owo, and Akure Divisions of the High Court.\n\nIn 2004, he was appointed Chairman of the Commission of Enquiry set up by the administration of the late Dr. Olusegun Agagu to investigate contract awards under the administration of Chief Adefarati. He also served as a member of the Borno State Governorship Election Tribunal in 2011. In September 2021, he was appointed Chief Judge of the Ondo State Judiciary by Governor Oluwarotimi Odunayo Akeredolu, SAN (now late). Justice Akintoroye retired from service on the 4th of November, 2022, upon reaching the mandatory retirement age of 65.\n\nAs a dedicated, innovative, and committed professional, Justice Akintoroye has worked closely with the pioneering staff of the Commission to establish a strong foundation that will serve as a legacy for future leadership. He is happily married with children.",
      "education": [
      "LL.B, University of Lagos (1983)",
      "BL, Nigerian Law School (1984)"
      ],
      "achievements": [
      "Chief Judge of Ondo State Judiciary (2021-2022)",
      "Pioneer Chairman, Ondo State Public Complaints, Financial Crime and Anti-Corruption Commission",
      "High Court Judge, Ondo State Judiciary (2002-2022)",
      "Chairman, Commission of Enquiry (2004)",
      "Member, Borno State Governorship Election Tribunal (2011)"
      ]
      },
    {
      "id": "adewole-adeyeye",
      "name": "Professor Adewole Adeyeye",
      "credentials": "PhD",
      "position": "Secretary",
      "image": "/_static/images/pics/0-0.jpg",
      "bio": "Professor Adewole Adeyeye is presently the Secretary/Member of Board, Ondo State Public Complaints, Financial Crime and Anti-Corruption Commission (SPFACC). He was born into the family of Chief Asolo of Owo Kingdom on the 15th of June 1963. \n\n He attended Imade College Owo, but he eventually finished his secondary education at St Thomas Aquinas College, Akure in 1980. He attended Osogbo Grammar School for his Higher School Certificate (HSC) between 1980 and 1982. He later attended the University of Ibadan for his Bachelors degree in 1983. He did his National Youth Service Corps (NYSC) at Federal College of Education Osiele in 1987. He obtained two Master degrees in Business Administration (M.B.A) in 1991 and M.A. (Applied Ethics) from the University of Ibadan in 1994. \n\n He started work at Department of Business studies, Federal Polytechnic Ilaro as a lecturer I. He rose to the rank of Principal lecturer in 2007. He left the polytechnic to establish the Centre for Organisational and Professional Ethics (COPE AFRICA). In 2008, he bagged a doctorate degree (PhD) in Applied Ethics with specialization in International Business Ethics. In 2011, he joined Ondo State University of Science and Technology as a lecturer I and rose through the rank to become a Professor in 2018. \n\n He is the pioneer Head of General and Entrepreneurial Studies. Director, Centre for Entrepreneurship and Leadership Training (CELT). He is also the pioneer Dean, School of Management Science (SMS) of Olusegun Agagu University of Science and Technology. \n\n His research interests include: Business Ethics, Applied Ethics, Business and Management studies, Ethics of governance, Professional Ethics Anti-Corruption and Compliance. \n\n He has over 68 publications to his credit that include refereed journals, conference proceedings, technical reports, edited works and chapter contributions. \n\n Professor Adewole Adeyeye is a member of many national and international professional societies (APPE, SBE, DSA, WASBE, BEN-AFRICA), etc. \n\n He is a Lead consultant, United Nations Development Programme (UNDP), United Nations Convention against Corruption (UNCAC), United Nation Office on Drugs and Crime (UNODC), Zero Corruption Coalition (ZCC). He is a Certified Corruption Risk Assessor (CRA). \n\n He developed the Ethics Training manual for the 29 Police Training Schools (PTS) across Nigeria with full sponsorship by the United Nation Office on Drug and Crime (UNODC). He is a Technical Consultant to International Standard Organisations (ISO). He is a Consultant and Vice-Chair, National Mirror committee on ISO by the Standard Organisation of Nigeria (SON). \n\n He is the Founder/Executive Director, Centre for Organisational and Professional Ethics (COPE-AFRICA); Co-convener, Ethical practices worldwide, United Kingdom, Regulatory Institutional Network (REGNET) Africa-UK/Rwanda, Executive Secretary, West African Society on Business Ethics (WASBE), President, Global Best Educational Advancement Services Limited (GBEAS). \n\n He is a member Association of Professional Bodies of Nigeria (APBN), Fellow Ethics Centre, University of Cambridge. \n\n He has received various grants from organizations such as Carnegie Mellon, NCDMB. He is a visiting Professor to the University of Ibadan Business School. \n\n He is an accredited Due Process Observer by Bureau of Public Procurement (BPP) supervising about seventeen (17) federal government agencies. He is Due process Trainer. \n\n Prof Adeyeye is a World Bank accredited contract monitoring expert and Advisor to the Office of the Special Adviser to the President on CSO's. \n\n He was the Team Leader, UNODC/ICPC sponsored Constituency Project Tracking and Monitoring Team 2015 – 2019. \n\n He was the lead consultant, Oyo State Due Process Audit Team for Ministries, Department and Agencies 2011 to 2019.",
      "education": [
        "PhD in Applied Ethics (2008)",
        "M.A. Applied Ethics, University of Ibadan (1994)",
        "MBA, University of Ibadan (1991)",
        "Bachelor's Degree, University of Ibadan (1983)"
      ],
      "achievements": [
        "Professor at Olusegun Agagu University of Science and Technology (2018)",
        "Pioneer Dean, School of Management Science",
        "Director, Centre for Entrepreneurship and Leadership Training",
        "Over 68 academic publications",
        "Certified Corruption Risk Assessor"
      ]
    },


{
  "id": "kemi-akerele",
  "name": "Kemi Akerele, Esq. AICMC",
  "credentials": "LL.B, BL, AICMC",
  "position": "Legal Officer",
  "image": "/_static/images/pics/0-2.jpg",
  "bio": "Kemi Akerele currently serves in the legal department of the Commission, having joined in April 2024. She has played a crucial role in the formative stage of the Commission, leveraging her legal expertise to provide advisory support in the best interest of the institution. With her extensive knowledge and experience in court procedures and oath registry, she effectively navigates the complexities of public complaints, financial matters, and corruption investigations.\n\nShe holds a Bachelor of Laws (LL.B) degree from Obafemi Awolowo University, Ile-Ife, and was called to the Nigerian Bar over a decade ago. Prior to joining the Commission, she was seconded from the state judiciary, where she served as a Legal Research Officer. Kemi is an Associate Member of the Institute of Chartered Mediators and Conciliators and an active member of the Nigerian Bar Association, Federation of Female Lawyers, and the Nigerian Women Lawyers Forum.",
  "education": [
  "LL.B, Obafemi Awolowo University, Ile-Ife",
  "BL, Nigerian Law School"
  ],
  "affiliations": [
  "Associate Member, Institute of Chartered Mediators and Conciliators",
  "Member, Nigerian Bar Association",
  "Member, Federation of Female Lawyers",
  "Member, Nigerian Women Lawyers Forum"
  ]
  },


  {
    "id": "okuneye-adewale-gbenga",
    "name": "Okuneye Adewale Gbenga",
    "credentials": "B.Sc Accounting, ANAN, CIFCON",
    "position": "Director of Finance and Accounts",
    "image": "/_static/images/pics/0-3.jpg",
    "bio": "Okuneye Adewale Gbenga is a seasoned accountant with extensive experience in public finance and auditing. He currently serves as the Director of Accounts at the Ondo State Public Complaints, Financial Crime and Anti-Corruption Commission. His career in the Ondo State Civil Service spans over two decades, during which he has held key positions in financial management and payroll administration.\n\nBorn on October 11, 1974, in Ogun State, Nigeria, he began his academic journey at Ifesowapo High School, Imosan, Ijebu, before proceeding to Ilugun Alaro Grammar School, Ilugun. He later obtained a Bachelor’s degree in Accounting (B.Sc) in 2016.\n\nOkuneye started his professional career in the Ministry of Natural Resources, Ondo State, where he worked from 2002 to 2006. He then moved to the Office of the Accountant-General, Ondo State, where he served as a Desk Officer and Payroll Administrator from 2006 to 2021. He later became an Internal Auditor at the Ministry of Energy and Mineral Resources (2021-2024) before assuming his current role.\n\nAs a member of the Association of National Accountants of Nigeria (ANAN) and the Chartered Institute of Finance and Control (CIFCON), he brings a wealth of knowledge in financial accountability and control to the Commission. He is dedicated to fostering transparency and efficiency in public finance management.\n\nHe is happily married and enjoys mentoring young professionals in the field of accounting and finance.",
    "education": [
    "West African School Certificate (WASC), 1986",
    "B.Sc Accounting, 2016"
    ],
    "affiliations": [
    "Member, Association of National Accountants of Nigeria (ANAN)",
    "Member, Chartered Institute of Finance and Control (CIFCON)"
    ]
    }
  
  ]
}

